emacs_mu4e.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-01-22 Wed 00:03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs - Mu4e</title>
<meta name="generator" content="Org mode">
<meta name="author" content="shaka">
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emacs - Mu4e</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org321c8e9">Introduction</a></li>
<li><a href="#org35fe27f">Installation</a>
<ul>
<li><a href="#org357c7c7">Dependencies</a></li>
<li><a href="#orgd7745ef"><code>mu</code></a></li>
<li><a href="#org551f0c5"><code>getmail</code> and <code>procmail</code></a></li>
</ul>
</li>
<li><a href="#org8a2d895">Configuration</a>
<ul>
<li><a href="#org63f54ef"><code>getmailrc</code></a></li>
<li><a href="#org742fb16"><code>~/.procmailrc</code></a></li>
<li><a href="#org64f70f3"><code>~/.emacs.d/init.el</code></a></li>
<li><a href="#org07f76bf"><code>~/.authinfo</code></a></li>
<li><a href="#orgf747d95">Others</a>
<ul>
<li><a href="#orgc69f0d0">Create a maildir</a></li>
<li><a href="#org51d8183">Get the mails</a></li>
<li><a href="#orgf10f21a">Index the mails</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org321c8e9" class="outline-2">
<h2 id="org321c8e9">Introduction</h2>
<div class="outline-text-2" id="text-org321c8e9">
<p>
<a href="http://www.djcbsoftware.nl/code/mu/mu4e/index.html">mu4e</a> is an excellent mail client for Emacs whereby sending/getting mails can be carried out in Emacs. For an Emacs user, the deep integration gives rise to great convenience and efficiency. This post provides a brief summary for the utilization of mu4e.
</p>
</div>
</div>
<div id="outline-container-org35fe27f" class="outline-2">
<h2 id="org35fe27f">Installation</h2>
<div class="outline-text-2" id="text-org35fe27f">
</div>
<div id="outline-container-org357c7c7" class="outline-3">
<h3 id="org357c7c7">Dependencies</h3>
<div class="outline-text-3" id="text-org357c7c7">
<p>
<code>mu</code> depends on <a href="http://xapian.org">xapian</a> and <a href="http://spruce.sourceforge.net/gmime">gmime</a>, which should be installed in advance.
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S xapian-core gmime
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd7745ef" class="outline-3">
<h3 id="orgd7745ef"><code>mu</code><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h3>
<div class="outline-text-3" id="text-orgd7745ef">
<div class="org-src-container">
<pre class="src src-sh">git clone --depth=1 git://github.com/djcb/mu.git
<span style="color: #e090d7;">cd</span> mu
autoreconf -i
./configure --prefix=/opt/mu
make
make install
ln -s /opt/mu/bin/mu /usr/local/bin
</pre>
</div>
</div>
</div>
<div id="outline-container-org551f0c5" class="outline-3">
<h3 id="org551f0c5"><code>getmail</code> and <code>procmail</code></h3>
<div class="outline-text-3" id="text-org551f0c5">
<div class="org-src-container">
<pre class="src src-sh">pacman -S getmail procmail
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8a2d895" class="outline-2">
<h2 id="org8a2d895">Configuration</h2>
<div class="outline-text-2" id="text-org8a2d895">
</div>
<div id="outline-container-org63f54ef" class="outline-3">
<h3 id="org63f54ef"><code>getmailrc</code></h3>
<div class="outline-text-3" id="text-org63f54ef">
<div class="org-src-container">
<pre class="src src-sh">[retriever]
<span style="color: #e090d7;">type</span> = SimplePOP3SSLRetriever
server = POP_SERVER
port = PORT_NUM
username = USER_NAME
password = PASSWORD

[destination]
<span style="color: #e090d7;">type</span> = MDA_external
path = /usr/bin/procmail

[options]
read_all = false
delete = false
verbose = 0
message_log = $<span style="color: #fcaf3e;">HOME</span>/.Mail/getmail.log
</pre>
</div>
</div>
</div>
<div id="outline-container-org742fb16" class="outline-3">
<h3 id="org742fb16"><code>~/.procmailrc</code></h3>
<div class="outline-text-3" id="text-org742fb16">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #fcaf3e;">MAILDIR</span>=$<span style="color: #fcaf3e;">HOME</span>/.Mail
<span style="color: #fcaf3e;">DEFAULT</span>=$<span style="color: #fcaf3e;">MAILDIR</span>/inbox/
<span style="color: #fcaf3e;">LOGFILE</span>=$<span style="color: #fcaf3e;">MAILDIR</span>/procmail.log
<span style="color: #fcaf3e;">VERBOSE</span>=yes

:0:
* ^(To|Cc): 3GPP_TSG_RAN_WG1@LIST.ETSI.ORG
r1/

:0:
* ^(To|Cc): 3GPP_TSG_RAN_WG1_NR@LIST.ETSI.ORG
r1nr/

:0:
* ^(To|Cc): 3GPP_TSG_RAN@LIST.ETSI.ORG
rp/
</pre>
</div>
</div>
</div>
<div id="outline-container-org64f70f3" class="outline-3">
<h3 id="org64f70f3"><code>~/.emacs.d/init.el</code></h3>
<div class="outline-text-3" id="text-org64f70f3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #e9b96e;">"/opt/mu/share/emacs/site-lisp/mu4e"</span>)
(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">mu4e</span>)
(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">org-mu4e</span>)

(<span style="color: #b4fa70;">setq</span> user-full-name <span style="color: #e9b96e;">"NAME"</span>
      user-mail-address <span style="color: #e9b96e;">"EMAIL_ADDRESS"</span>
      mu4e-compose-signature <span style="color: #e9b96e;">"SIGNATURE"</span>)

(<span style="color: #b4fa70;">setq</span> mu4e-maildir <span style="color: #e9b96e;">"~/.Mail"</span>
      mu4e-drafts-folder <span style="color: #e9b96e;">"/drafts"</span>
      mu4e-sent-folder <span style="color: #e9b96e;">"/sent"</span>
      mu4e-trash-folder <span style="color: #e9b96e;">"/trash"</span>)

(<span style="color: #b4fa70;">setq</span> mu4e-headers-fields '((<span style="color: #e090d7;">:human-date</span> . 12)
                            (<span style="color: #e090d7;">:flags</span> . 6)
                            (<span style="color: #e090d7;">:mailing-list</span> . 10)
                            (<span style="color: #e090d7;">:from</span> . 22)
                            (<span style="color: #e090d7;">:thread-subject</span>)))

(<span style="color: #b4fa70;">setq</span> message-send-mail-function 'smtpmail-send-it
      smtpmail-default-smtp-server <span style="color: #e9b96e;">"SMTP_SERVER"</span>
      smtpmail-smtp-server <span style="color: #e9b96e;">"SMTP_SERVER"</span>
      smtpmail-stream-type 'starttls
      smtpmail-smtp-service PORT_NUM)

(<span style="color: #b4fa70;">setq</span> mu4e-get-mail-command <span style="color: #e9b96e;">"getmail --getmaildir=GETMAIL_CONFIG_DIR -r getmailrc"</span>)

(<span style="color: #b4fa70;">setq</span> mail-user-agent 'mu4e-user-agent
      mu4e-user-mail-address-list '(<span style="color: #e9b96e;">"EMAIL_ADDRESS"</span>)
      mu4e-completing-read-function (<span style="color: #b4fa70;">quote</span> completing-read)
      mu4e-confirm-quit nil
      mu4e-attachment-dir <span style="color: #e9b96e;">"~/Downloads"</span>
      mu4e-html2text-command <span style="color: #e9b96e;">"w3m -dump -T text/html -M"</span>
      mu4e-use-fancy-chars t
      mu4e-view-show-images t
      mu4e-view-show-addresses t
      mu4e-update-interval 180
      mu4e-change-filenames-when-moving t
      message-kill-buffer-on-exit t
      org-mu4e-convert-to-html t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org07f76bf" class="outline-3">
<h3 id="org07f76bf"><code>~/.authinfo</code></h3>
<div class="outline-text-3" id="text-org07f76bf">
<div class="org-src-container">
<pre class="src src-sh">machine SMTP_SERVER login USER password PASSWORD port PORT_NUM
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf747d95" class="outline-3">
<h3 id="orgf747d95">Others</h3>
<div class="outline-text-3" id="text-orgf747d95">
</div>
<div id="outline-container-orgc69f0d0" class="outline-4">
<h4 id="orgc69f0d0">Create a maildir</h4>
<div class="outline-text-4" id="text-orgc69f0d0">
<div class="org-src-container">
<pre class="src src-sh">mkdir .Mail
</pre>
</div>
</div>
</div>
<div id="outline-container-org51d8183" class="outline-4">
<h4 id="org51d8183">Get the mails</h4>
<div class="outline-text-4" id="text-org51d8183">
<div class="org-src-container">
<pre class="src src-sh">getmail --getmaildir=GETMAIL_CONFIG_DIR -r getmailrc
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf10f21a" class="outline-4">
<h4 id="orgf10f21a">Index the mails</h4>
<div class="outline-text-4" id="text-orgf10f21a">
<div class="org-src-container">
<pre class="src src-sh">mu index --maildir=~/.Mail
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<code>mu4e</code> is essentially a part of <code>mu</code>.
</p></div></div>


</div>
</div></div>
</body>
</html>
